---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsAreaBasedLoadType
source: html/4cebc92f-89af-c890-77f2-3bcc7ea2a046.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsAreaBasedLoadType Property

"Area Based Load Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsAreaBasedLoadType { get; }
```